Revit 2024 API
ModuleSettings Properties
The ModuleSettings type exposes the following members.
Properties
Name | Description
Description
 The module description.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MacroLanguageType
 The Macro language type.
Name
 The module name.
See Also
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace